app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
  def index
    @recipe = Recipe.all

INSERT INTO "recipes" ("title", "description", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?)  [["title", "h;kihj"], ["description", ";lj"], ["created_at", "2018-10-08 17:25:25.848505"], ["updated_at", "2018-10-08 17:25:25.848505"], ["image", "Screen_Shot_2018-08-17_at_6.53.14_AM.png"]]
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id
    respond_to do |format|
      if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "image" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["image", "Screen_Shot_2018-08-17_at_6.53.14_AM.png"], ["updated_at", "2018-10-08 17:27:30.104077"], ["id", 3]]
---
  def update
    @recipe = Recipe.find(params[:id])

    respond_to do |format|
      if @recipe.update_attributes(recipe_params)